<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB; //ハッシュ化

class ItemsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('items')->insert([
            [
                'user_id' => 1,
                'name' => 'デニムシャツ',
                'type' => 'トップス',
                'detail' => 'カジュアルなスタイルに最適',
                'price' => 4700,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'デニムシャツ',
                'type' => 'トップス',
                'detail' => 'カジュアルなスタイルに最適',
                'price' => 4700,
                'color' => 'ライトブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'デニムシャツ',
                'type' => 'トップス',
                'detail' => 'カジュアルなスタイルに最適',
                'price' => 4700,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レザージャケット',
                'type' => 'アウター',
                'detail' => 'クールでスタイリッシュな印象を与える',
                'price' => 12000,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フリンジバッグ',
                'type' => 'バッグ',
                'detail' => 'ボヘミアンな雰囲気を演出',
                'price' => 7500,
                'color' => 'ブラウン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フリンジバッグ',
                'type' => 'バッグ',
                'detail' => 'ボヘミアンな雰囲気を演出',
                'price' => 7500,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フリンジバッグ',
                'type' => 'バッグ',
                'detail' => 'ボヘミアンな雰囲気を演出',
                'price' => 7500,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ワイドパンツ',
                'type' => 'ボトムス',
                'detail' => 'リラックス感のある穿き心地',
                'price' => 7000,
                'color' => 'レッド',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ワイドパンツ',
                'type' => 'ボトムス',
                'detail' => 'リラックス感のある穿き心地',
                'price' => 7000,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ワイドパンツ',
                'type' => 'ボトムス',
                'detail' => 'リラックス感のある穿き心地',
                'price' => 7000,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レースブラウス',
                'type' => 'トップス',
                'detail' => 'フェミニンな魅力を引き出す',
                'price' => 4500,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レースブラウス',
                'type' => 'トップス',
                'detail' => 'フェミニンな魅力を引き出す',
                'price' => 4500,
                'color' => 'ピンク',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レースブラウス',
                'type' => 'トップス',
                'detail' => 'フェミニンな魅力を引き出す',
                'price' => 4500,
                'color' => 'ライトブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フラワープリントワンピース',
                'type' => 'ワンピース',
                'detail' => '華やかな春らしいデザイン',
                'price' => 7800,
                'color' => 'ピンク',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フラワープリントワンピース',
                'type' => 'ワンピース',
                'detail' => '華やかな春らしいデザイン',
                'price' => 7800,
                'color' => 'ピンク',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フラワープリントワンピース',
                'type' => 'ワンピース',
                'detail' => '華やかな春らしいデザイン',
                'price' => 7800,
                'color' => 'イエロー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フラワープリントワンピース',
                'type' => 'ワンピース',
                'detail' => '華やかな春らしいデザイン',
                'price' => 7800,
                'color' => 'ライトグリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ハイヒールパンプス',
                'type' => 'シューズ',
                'detail' => '足元を華やかに演出する',
                'price' => 5500,
                'color' => 'レッド',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ハイヒールパンプス',
                'type' => 'シューズ',
                'detail' => '足元を華やかに演出する',
                'price' => 5500,
                'color' => 'イエロー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ハイヒールパンプス',
                'type' => 'シューズ',
                'detail' => '足元を華やかに演出する',
                'price' => 5500,
                'color' => 'グリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ハイヒールパンプス',
                'type' => 'シューズ',
                'detail' => '足元を華やかに演出する',
                'price' => 5500,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ハイヒールパンプス',
                'type' => 'シューズ',
                'detail' => '足元を華やかに演出する',
                'price' => 5500,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'カシミヤニットセーター',
                'type' => 'トップス',
                'detail' => '上質な素材で暖かさを提供',
                'price' => 6700,
                'color' => 'グレー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'カシミヤニットセーター',
                'type' => 'トップス',
                'detail' => '上質な素材で暖かさを提供',
                'price' => 6700,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボタニカルプリントブラウス',
                'type' => 'トップス',
                'detail' => '自然を感じさせる爽やかなデザイン',
                'price' => 6500,
                'color' => 'ライトグリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボタニカルプリントブラウス',
                'type' => 'トップス',
                'detail' => '自然を感じさせる爽やかなデザイン',
                'price' => 6500,
                'color' => 'グリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボタニカルプリントブラウス',
                'type' => 'トップス',
                'detail' => '自然を感じさせる爽やかなデザイン',
                'price' => 6500,
                'color' => 'ブラウン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ストライプ柄ワイドシャツ',
                'type' => 'トップス',
                'detail' => 'リラックス感のあるシルエットが特徴',
                'price' => 4700,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ストライプ柄ワイドシャツ',
                'type' => 'トップス',
                'detail' => 'リラックス感のあるシルエットが特徴',
                'price' => 4700,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'キャンバススニーカー',
                'type' => 'シューズ',
                'detail' => 'カジュアルなスタイルにぴったり',
                'price' => 6800,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レースアップブーツ',
                'type' => 'シューズ',
                'detail' => 'スタイリッシュな印象を演出',
                'price' => 7800,
                'color' => 'ブラウン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レースアップブーツ',
                'type' => 'シューズ',
                'detail' => 'スタイリッシュな印象を演出',
                'price' => 7800,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レトロフラワープリントスカート',
                'type' => 'ボトムス',
                'detail' => 'ヴィンテージ感漂うロマンティックなデザイン',
                'price' => 4000,
                'color' => 'グリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レトロフラワープリントスカート',
                'type' => 'ボトムス',
                'detail' => 'ヴィンテージ感漂うロマンティックなデザイン',
                'price' => 4000,
                'color' => 'ブラウン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ベルト付きキャミソール',
                'type' => 'トップス',
                'detail' => 'ウエストを引き締めるベルトが付属',
                'price' => 3800,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ベルト付きキャミソール',
                'type' => 'トップス',
                'detail' => 'ウエストを引き締めるベルトが付属',
                'price' => 3800,
                'color' => 'グレー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ベルト付きキャミソール',
                'type' => 'トップス',
                'detail' => 'ウエストを引き締めるベルトが付属',
                'price' => 3800,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'デニムミニスカート',
                'type' => 'ボトムス',
                'detail' => 'カジュアルな着こなしにぴったりのアイテム',
                'price' => 4500,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'デニムミニスカート',
                'type' => 'ボトムス',
                'detail' => 'カジュアルな着こなしにぴったりのアイテム',
                'price' => 4500,
                'color' => 'ライトブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'デニムミニスカート',
                'type' => 'ボトムス',
                'detail' => 'カジュアルな着こなしにぴったりのアイテム',
                'price' => 4500,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボヘミアンスタイルワンピース',
                'type' => 'ワンピース',
                'detail' => '自由な雰囲気を演出するボヘミアンスタイル',
                'price' => 7800,
                'color' => 'レッド',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボヘミアンスタイルワンピース',
                'type' => 'ワンピース',
                'detail' => '自由な雰囲気を演出するボヘミアンスタイル',
                'price' => 7800,
                'color' => 'オレンジ',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボヘミアンスタイルワンピース',
                'type' => 'ワンピース',
                'detail' => '自由な雰囲気を演出するボヘミアンスタイル',
                'price' => 7800,
                'color' =>'グリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レザーベルト',
                'type' => 'アクセサリー',
                'detail' => 'シンプルで使いやすいデザイン',
                'price' => 2300,
                'color' => 'ブラウン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レザーベルト',
                'type' => 'アクセサリー',
                'detail' => 'シンプルで使いやすいデザイン',
                'price' => 2300,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'レザーベルト',
                'type' => 'アクセサリー',
                'detail' => 'シンプルで使いやすいデザイン',
                'price' => 2300,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フェザーピアス',
                'type' => 'アクセサリー',
                'detail' => 'エキゾチックな雰囲気を醸し出す',
                'price' => 2500,
                'color' => 'グレー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'フェザーピアス',
                'type' => 'アクセサリー',
                'detail' => 'エキゾチックな雰囲気を醸し出す',
                'price' => 2500,
                'color' => 'ブラウン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボーダーカットソー',
                'type' => 'トップス',
                'detail' => 'シンプルで使いやすい定番アイテム',
                'price' => 4200,
                'color' => 'レッド',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボーダーカットソー',
                'type' => 'トップス',
                'detail' => 'シンプルで使いやすい定番アイテム',
                'price' => 4200,
                'color' => 'オレンジ',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボーダーカットソー',
                'type' => 'トップス',
                'detail' => 'シンプルで使いやすい定番アイテム',
                'price' => 4200,
                'color' => 'イエロー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボーダーカットソー',
                'type' => 'トップス',
                'detail' => 'シンプルで使いやすい定番アイテム',
                'price' => 4200,
                'color' => 'グリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボーダーカットソー',
                'type' => 'トップス',
                'detail' => 'シンプルで使いやすい定番アイテム',
                'price' => 4200,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ベルベットヘッドバンド',
                'type' => 'アクセサリー',
                'detail' => '上品な光沢が魅力的',
                'price' => 1800,
                'color' => 'レッド',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ベルベットヘッドバンド',
                'type' => 'アクセサリー',
                'detail' => '上品な光沢が魅力的',
                'price' => 1800,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ロングリブニットワンピース',
                'type' => 'ワンピース',
                'detail' => 'シンプルなデザインで着回し力抜群',
                'price' => 6800,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ロングリブニットワンピース',
                'type' => 'ワンピース',
                'detail' => 'シンプルなデザインで着回し力抜群',
                'price' => 6800,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'キルティングジャケット',
                'type' => 'アウター',
                'detail' => '暖かさと軽さを両立した優れたアウター',
                'price' => 12600,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'キルティングジャケット',
                'type' => 'アウター',
                'detail' => '暖かさと軽さを両立した優れたアウター',
                'price' => 12600,
                'color' => 'ホワイト',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボヘミアンスカーフ',
                'type' => 'アクセサリー',
                'detail' => 'エスニックな雰囲気を楽しめる',
                'price' => 1800,
                'color' => 'レッド',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボヘミアンスカーフ',
                'type' => 'アクセサリー',
                'detail' => 'エスニックな雰囲気を楽しめる',
                'price' => 1800,
                'color' => 'グリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ボーダープリントタンクトップ',
                'type' => 'トップス',
                'detail' => '夏にぴったりの爽やかなデザイン',
                'price' => 2500,
                'color' => 'ライトブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'デニムショートパンツ',
                'type' => 'ボトムス',
                'detail' => 'カジュアルなスタイルに欠かせないアイテム',
                'price' => 4000,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ストレッチジョガーパンツ',
                'type' => 'ボトムス',
                'detail' => '動きやすさを追求した快適な履き心地',
                'price' => 5000,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'ストレッチジョガーパンツ',
                'type' => 'ボトムス',
                'detail' => '動きやすさを追求した快適な履き心地',
                'price' => 5000,
                'color' => 'グレー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'スリムフィットジーンズ',
                'type' => 'ボトムス',
                'detail' => '清潔感あふれるスタイリッシュなデザイン',
                'price' => 6700,
                'color' => 'ブルー',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'キャップ',
                'type' => 'アクセサリー',
                'detail' => 'スポーティーなアクセントをプラス',
                'price' => 2300,
                'color' => 'レッド',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'キャップ',
                'type' => 'アクセサリー',
                'detail' => 'スポーティーなアクセントをプラス',
                'price' => 2300,
                'color' => 'オレンジ',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'キャップ',
                'type' => 'アクセサリー',
                'detail' => 'スポーティーなアクセントをプラス',
                'price' => 2300,
                'color' => 'グリーン',
                'created_at' => '2024/01/01 11:11:11'
            ],
            [
                'user_id' => 1,
                'name' => 'キャップ',
                'type' => 'アクセサリー',
                'detail' => 'スポーティーなアクセントをプラス',
                'price' => 2300,
                'color' => 'ブラック',
                'created_at' => '2024/01/01 11:11:11'
            ],
        ]);
    }
}
